In [5]:
import pandas as pd

In [6]:
s1=pd.Series(['hi','bye','ok'])
s1

0     hi
1    bye
2     ok
dtype: object

In [11]:
s1=pd.Series(data=['hi','bye','ok'],index=['a','b','c']) # pandas in series with indexing value
s1

a     hi
b    bye
c     ok
dtype: object

In [12]:
s1=pd.Series(['drama','sci-fic','romantic','love','fight','web-series'])
s1

0         drama
1       sci-fic
2      romantic
3          love
4         fight
5    web-series
dtype: object

In [17]:
s1.ndim #dimension

1

In [20]:
s1.shape #shape of the string

(6,)

In [21]:
s1.dtype

dtype('O')

In [23]:
s1.unique # for finding the unique element

<bound method Series.unique of 0         drama
1       sci-fic
2      romantic
3          love
4         fight
5    web-series
dtype: object>

In [26]:
s1.nunique() # for determine no of unique elements

6

# hi dude! 
  whatsapp

In [27]:
#by comment by markdown in dark

In [29]:
s1.value_counts() #no of occurence of element

love          1
fight         1
drama         1
romantic      1
sci-fic       1
web-series    1
dtype: int64

In [31]:
s1.is_unique #to check unique element

True

In [32]:
s1[4]

'fight'

In [38]:
s1.loc[4] #  to find element as wished loction

'fight'

In [39]:
s1[[1,4,3]]

1    sci-fic
4      fight
3       love
dtype: object

In [42]:
s1.iloc[1:2] # end value excluded

1    sci-fic
dtype: object

In [44]:
s1.values # series converted into array

array(['drama', 'sci-fic', 'romantic', 'love', 'fight', 'web-series'],
      dtype=object)

In [45]:
s1.tolist()

['drama', 'sci-fic', 'romantic', 'love', 'fight', 'web-series']

In [46]:
df=pd.DataFrame(['hi','dude'])
df

      0
0    hi
1  dude

In [50]:
df.index=['a','b']
df.columns=['A']
df # data frame

      A
a    hi
b  dude

In [51]:
df=pd.DataFrame(data=['hi','dude'],index=['a','b'],columns=['A'])
df

      A
a    hi
b  dude

In [60]:
df1=pd.DataFrame([['zero','100cr','srk'],['Bharat','200cr','salman'],['barfi','150cr', 'ranveer-k']],
                       columns=['movie','Earning','actor'],index=['1','2','3'])
df1

    movie Earning      actor
1    zero   100cr        srk
2  Bharat   200cr     salman
3   barfi   150cr  ranveer-k

In [63]:
df1['actor'] #sub data frame

1          srk
2       salman
3    ranveer-k
Name: actor, dtype: object

In [66]:
df1[['movie']]

    movie
1    zero
2  Bharat
3   barfi

In [67]:
df1[['movie','actor']]

    movie      actor
1    zero        srk
2  Bharat     salman
3   barfi  ranveer-k

In [78]:
df1.loc['1':'3','movie':'Earning']

    movie Earning
1    zero   100cr
2  Bharat   200cr
3   barfi   150cr

In [79]:
df1.loc[['1','2'],['movie','actor']] # access the element from data frame

    movie   actor
1    zero     srk
2  Bharat  salman

In [80]:
df1.iloc[0:1,1:3]

  Earning actor
1   100cr   srk

In [87]:
df1.iloc[[0,1,2],[0,1,2]]

    movie Earning      actor
1    zero   100cr        srk
2  Bharat   200cr     salman
3   barfi   150cr  ranveer-k

In [91]:
df1.Earning>'150cr' # boolean type data frame

1    False
2     True
3    False
Name: Earning, dtype: bool

In [92]:
df1[df1.Earning>'150cr'] # boolean compairing

    movie Earning   actor
2  Bharat   200cr  salman

In [95]:
df1['production']=['T-SERIES','SONY','DHARMA PRO']

In [97]:
df1 # ADDING column in data frame

    movie Earning      actor  production
1    zero   100cr        srk    T-SERIES
2  Bharat   200cr     salman        SONY
3   barfi   150cr  ranveer-k  DHARMA PRO

In [99]:
df1.insert(0,'date',['25-dec','eid','holi'])

In [101]:
df1 # add column at beggininng

     date   movie Earning      actor  production
1  25-dec    zero   100cr        srk    T-SERIES
2     eid  Bharat   200cr     salman        SONY
3    holi   barfi   150cr  ranveer-k  DHARMA PRO

In [107]:
df1.loc[4]=['april','robot-2.0','300cr','rajnikant','T-serise'] # add to a row in data frame

In [108]:
df1

     date      movie Earning      actor  production
1  25-dec       zero   100cr        srk    T-SERIES
2     eid     Bharat   200cr     salman        SONY
3    holi      barfi   150cr  ranveer-k  DHARMA PRO
4   april  robot-2.0   300cr  rajnikant    T-serise

In [109]:
type(df1)

pandas.core.frame.DataFrame

In [110]:
df1.ndim

2

In [111]:
df1.index

Index(['1', '2', '3', 4], dtype='object')

In [112]:
df1.columns

Index(['date', 'movie', 'Earning', 'actor', 'production'], dtype='object')

In [113]:
df1.shape

(4, 5)

In [116]:
df1.dtypes

date          object
movie         object
Earning       object
actor         object
production    object
dtype: object

In [118]:
df1.movie.unique()

array(['zero', 'Bharat', 'barfi', 'robot-2.0'], dtype=object)

In [124]:
df1['movie'].nunique()

4

In [126]:
df1.movie.value_counts()

barfi        1
robot-2.0    1
Bharat       1
zero         1
Name: movie, dtype: int64

In [129]:
df1.sort_values('Earning',inplace=False) # sort on basis of earning

     date      movie Earning      actor  production
1  25-dec       zero   100cr        srk    T-SERIES
3    holi      barfi   150cr  ranveer-k  DHARMA PRO
2     eid     Bharat   200cr     salman        SONY
4   april  robot-2.0   300cr  rajnikant    T-serise

In [130]:
df1.drop('actor',axis=1,inplace=False)

     date      movie Earning  production
1  25-dec       zero   100cr    T-SERIES
2     eid     Bharat   200cr        SONY
3    holi      barfi   150cr  DHARMA PRO
4   april  robot-2.0   300cr    T-serise

In [133]:
df1.drop('2',axis=0,inplace=False) # row 2 inplace

     date      movie Earning      actor  production
1  25-dec       zero   100cr        srk    T-SERIES
3    holi      barfi   150cr  ranveer-k  DHARMA PRO
4   april  robot-2.0   300cr  rajnikant    T-serise

In [134]:
del df1['date']

In [135]:
df1 # delete column

       movie Earning      actor  production
1       zero   100cr        srk    T-SERIES
2     Bharat   200cr     salman        SONY
3      barfi   150cr  ranveer-k  DHARMA PRO
4  robot-2.0   300cr  rajnikant    T-serise

In [136]:
pop=df1.pop('actor')

In [138]:
df1 # tempory delete column

       movie Earning  production
1       zero   100cr    T-SERIES
2     Bharat   200cr        SONY
3      barfi   150cr  DHARMA PRO
4  robot-2.0   300cr    T-serise

In [140]:
df1.isnull().sum() # to check null value

movie         0
Earning       0
production    0
dtype: int64